# Используем официальный образ Python как основу
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем сначала файл с зависимостями
# Это ускорит будущие сборки, если зависимости не менялись
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы проекта в рабочую директорию контейнера
COPY . .

# Указываем команду для запуска приложения при старте контейнера
CMD ["python", "run.py"]